# Pandas 학습
    1. 데이터 분석을 위한 모듈
        - 데이터 분석 빝 가공에 사영되는 파이썬 라이브러리
        - 사용 빈도가 굉장히 높음
        - Numpy 모듈 기반으로 생성됨
    2. http://pandas.pydata.org

### 학습 내용
    1. 기초 익히기
        - 이미 존재하는 파일의 내용을 DataFrame 생성하기
        - 중복 데이터 처리 기술
        - 결측치 처리 하기
        - 두개의 dataFrame 병합 : row / colum 기준

### 주요 객체
> 1. **series** :
    1. dataframe의 구성요소
        - 구조가 하나의 colum으로 구성 (dataframe의 하나의 컬럼)
> 2. **dataframe** : 
    1. 가로측과 세로축이 있는 엑셀과 유사한 구조
        - seriese들로 구성

In [2]:
import pandas as pd
import numpy as np

In [6]:
!pip show pandas

Name: pandas
Version: 0.23.4
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: http://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\users\playdata\anaconda3\lib\site-packages
Requires: python-dateutil, pytz, numpy
Required-by: seaborn, odo

### 기초익히기

In [8]:
p = pd.Series([1,2,3])
p

0    1
1    2
2    3
dtype: int64

In [9]:
type(p)

pandas.core.series.Series

In [12]:
p.values

array([1, 2, 3], dtype=int64)

In [13]:
p.index

RangeIndex(start=0, stop=3, step=1)

In [15]:
# 결측치 반영해보기
# NaN - not a Number
# 결측치 반영시 Series 의 각 요소의 데이터 타입 - float64 로 변경
p = pd.Series([1, np.nan, 3])
p

0    1.0
1    NaN
2    3.0
dtype: float64

In [3]:
datas= pd.date_range('20181210', periods = 6)
print(datas)

DatetimeIndex(['2018-12-10', '2018-12-11', '2018-12-12', '2018-12-13',
               '2018-12-14', '2018-12-15'],
              dtype='datetime64[ns]', freq='D')

In [30]:
df = pd.DataFrame(np.random.ranfdn(6,4), index = datas) # 6행 4열
df

                   0         1         2         3
2018-12-10  0.379428  1.057087  0.690672 -1.100415
2018-12-11  0.459795 -1.236661 -0.250624  1.948358
2018-12-12  0.292389 -0.042664 -0.566685  2.053395
2018-12-13  0.049867 -0.176498  0.668916  0.011132
2018-12-14 -0.124339 -1.788662 -0.168935 -1.761784
2018-12-15 -0.540842  0.818357  0.753776  1.773885

In [31]:
df = pd.DataFrame(np.random.randn(6,4), index = datas, columns=['a','b','c','d']) # 6행 4열
df

                   a         b         c         d
2018-12-10  1.558342 -1.572946  0.086986  0.923304
2018-12-11 -0.290137 -0.552569 -0.648360 -2.031389
2018-12-12 -0.697431  0.438184 -0.445619  1.819321
2018-12-13 -1.395159 -0.310460 -0.636245  1.117384
2018-12-14  0.145845 -0.025134 -0.720890 -0.913996
2018-12-15  0.445046 -1.508589 -1.523788 -1.065776

In [32]:
df.values

array([[ 1.55834162, -1.57294619,  0.08698564,  0.92330353],
       [-0.29013732, -0.55256853, -0.64835973, -2.03138911],
       [-0.69743133,  0.43818402, -0.44561893,  1.81932131],
       [-1.39515882, -0.31045992, -0.63624463,  1.11738374],
       [ 0.14584466, -0.02513359, -0.72088991, -0.91399597],
       [ 0.44504609, -1.50858855, -1.52378846, -1.06577597]])

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2018-12-10 to 2018-12-15
Freq: D
Data columns (total 4 columns):
a    6 non-null float64
b    6 non-null float64
c    6 non-null float64
d    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

### 정리
>   Series 생성 방법 <br>
    yyyymmdd 및 기간을 기준으로 날짜 자동 생성 하는 방법<br>
    Dataframe 객체 생성 방법, index 및 colum 적용 방법<br>

In [38]:
# 오름차순 - ascending = True
# 내림차순 - ascending = False
df.sort_values(by ='b', ascending=True)

                   a         b         c         d
2018-12-10  1.558342 -1.572946  0.086986  0.923304
2018-12-15  0.445046 -1.508589 -1.523788 -1.065776
2018-12-11 -0.290137 -0.552569 -0.648360 -2.031389
2018-12-13 -1.395159 -0.310460 -0.636245  1.117384
2018-12-14  0.145845 -0.025134 -0.720890 -0.913996
2018-12-12 -0.697431  0.438184 -0.445619  1.819321

In [39]:
df

                   a         b         c         d
2018-12-10  1.558342 -1.572946  0.086986  0.923304
2018-12-11 -0.290137 -0.552569 -0.648360 -2.031389
2018-12-12 -0.697431  0.438184 -0.445619  1.819321
2018-12-13 -1.395159 -0.310460 -0.636245  1.117384
2018-12-14  0.145845 -0.025134 -0.720890 -0.913996
2018-12-15  0.445046 -1.508589 -1.523788 -1.065776

In [42]:
type(df['a']) # 시리즈들이 모여서 데이터프레임을 생성한다

pandas.core.series.Series

In [44]:
df[0:3] # row 를 기준으로 0~3을 슬라이싱

                   a         b         c         d
2018-12-10  1.558342 -1.572946  0.086986  0.923304
2018-12-11 -0.290137 -0.552569 -0.648360 -2.031389
2018-12-12 -0.697431  0.438184 -0.445619  1.819321

In [47]:
# index 명으로 반환 설정 가능, 단 row 의 행 번호와 달리 지정한 영역까지 반영
df['2018-12-10':'2018-12-13']

                   a         b         c         d
2018-12-10  1.558342 -1.572946  0.086986  0.923304
2018-12-11 -0.290137 -0.552569 -0.648360 -2.031389
2018-12-12 -0.697431  0.438184 -0.445619  1.819321
2018-12-13 -1.395159 -0.310460 -0.636245  1.117384

### 정리
    index 로 검색시 번호 검색 0~3 이면 -1
    index 명으로 검색시 다 출력

loc 속성 <br>
- 데이터를 slicing 기술 <br>
- loc[index,colums]
- iloc[[index],[index]]
   :  행과 열의 번호를 이용해서 데이터 활용이 가능

In [99]:
df.loc['2018-12-12', ['a','b']] # 형식이 다름?

a   -0.697431
b    0.438184
Name: 2018-12-12 00:00:00, dtype: float64

In [57]:
type(df.loc)

pandas.core.indexing._LocIndexer

In [79]:
df.iloc[[2], [1,2]] # iloc()로 index번호로만 검색하기

                   b         c
2018-12-12  0.438184 -0.445619

In [86]:
x = df.iloc[[2]]
x
x.loc[:,['b']]

                   b
2018-12-12  0.438184

In [90]:
df.iloc[[2],[1]]

                   b
2018-12-12  0.438184

In [101]:
df.loc['2018-12-12','b']

0.43818401946210517

In [102]:
type(df.loc['2018-12-12','b'])

numpy.float64

In [89]:
type(df.iloc[[2],[1]])

pandas.core.frame.DataFrame

문제 - 12월 12일에 b컬럼값 반환 loc ? iloc ? 가 타입이 다름
활용하기 나름

In [127]:
# Dataframe 객체 복제해서 새로운 객체 생성해서 대입 -> copy()
df2 = df.copy()
df2

                    a         b         c         d
2018-12-10  10.000000 -1.572946  0.086986  0.923304
2018-12-11  -0.290137 -0.552569 -0.648360 -2.031389
2018-12-12  -0.697431  0.438184 -0.445619  1.819321
2018-12-13  -1.395159 -0.310460 -0.636245  1.117384
2018-12-14   0.145845 -0.025134 -0.720890 -0.913996
2018-12-15   0.445046 -1.508589 -1.523788 -1.065776

In [128]:

df2.loc['2018-12-10','a'] = 123
df2

                     a         b         c         d
2018-12-10  123.000000 -1.572946  0.086986  0.923304
2018-12-11   -0.290137 -0.552569 -0.648360 -2.031389
2018-12-12   -0.697431  0.438184 -0.445619  1.819321
2018-12-13   -1.395159 -0.310460 -0.636245  1.117384
2018-12-14    0.145845 -0.025134 -0.720890 -0.913996
2018-12-15    0.445046 -1.508589 -1.523788 -1.065776

In [129]:
type(df2.loc['2018-12-10','a'])

numpy.float64

In [130]:
# df의 주소값을 넘김 - 즉 객체지향
df3 = df
df3.iloc[[0],[0]] = 10
df3

                    a         b         c         d
2018-12-10  10.000000 -1.572946  0.086986  0.923304
2018-12-11  -0.290137 -0.552569 -0.648360 -2.031389
2018-12-12  -0.697431  0.438184 -0.445619  1.819321
2018-12-13  -1.395159 -0.310460 -0.636245  1.117384
2018-12-14   0.145845 -0.025134 -0.720890 -0.913996
2018-12-15   0.445046 -1.508589 -1.523788 -1.065776

In [135]:
# 이미 존재하는 dataframe 에 새로운 컬럼 추가
df2['e'] = [1,2,3,4,np.nan,6]
df2

                     a         b         c         d    e
2018-12-10  123.000000 -1.572946  0.086986  0.923304  1.0
2018-12-11   -0.290137 -0.552569 -0.648360 -2.031389  2.0
2018-12-12   -0.697431  0.438184 -0.445619  1.819321  3.0
2018-12-13   -1.395159 -0.310460 -0.636245  1.117384  4.0
2018-12-14    0.145845 -0.025134 -0.720890 -0.913996  NaN
2018-12-15    0.445046 -1.508589 -1.523788 -1.065776  6.0

In [132]:
type(df2['e'])

pandas.core.series.Series

In [133]:
# del df2['e']
df2

                     a         b         c         d
2018-12-10  123.000000 -1.572946  0.086986  0.923304
2018-12-11   -0.290137 -0.552569 -0.648360 -2.031389
2018-12-12   -0.697431  0.438184 -0.445619  1.819321
2018-12-13   -1.395159 -0.310460 -0.636245  1.117384
2018-12-14    0.145845 -0.025134 -0.720890 -0.913996
2018-12-15    0.445046 -1.508589 -1.523788 -1.065776

In [136]:
# 해당 데이터 열에 존재 여부 검증하는 함수
df2['e'].isin([1,3,5,6])

2018-12-10     True
2018-12-11    False
2018-12-12     True
2018-12-13    False
2018-12-14    False
2018-12-15     True
Freq: D, Name: e, dtype: bool

In [137]:
df['a'].max()

10.0

In [138]:
df['a'].min()

-1.3951588224862395

In [143]:
# a 컬럼에서 최대값 - 최소값 연산하기 : 연산식이 가능
df['a'].max() - df['a'].min()

11.39515882248624

In [144]:
# 모든 컬럼에서 최대값 - 최소값 연산하기 
df.max() - df.min()

a    11.395159
b     2.011130
c     1.610774
d     3.850710
dtype: float64

In [146]:
# 사용자 정의 함수를 호출 또는 람다 표현식을 사용 가능한 dataframe의 함수
# apply로 파라미터로 유입시켜 생성
# 최대값 - 최소값 : 각 컬럼별 데이터 파악 후 대소비교 후 연산
df.apply(lambda x : x.max() - x.min())

a    11.395159
b     2.011130
c     1.610774
d     3.850710
dtype: float64

In [154]:
# apply()가 몇번 호출될지 파악하는 로직을 lambda로 단순확인해보기
df.apply(lambda x : print(x,'\n----------------------'))

2018-12-10    10.000000
2018-12-11    -0.290137
2018-12-12    -0.697431
2018-12-13    -1.395159
2018-12-14     0.145845
2018-12-15     0.445046
Freq: D, Name: a, dtype: float64
----------------------
2018-12-10   -1.572946
2018-12-11   -0.552569
2018-12-12    0.438184
2018-12-13   -0.310460
2018-12-14   -0.025134
2018-12-15   -1.508589
Freq: D, Name: b, dtype: float64
----------------------
2018-12-10    0.086986
2018-12-11   -0.648360
2018-12-12   -0.445619
2018-12-13   -0.636245
2018-12-14   -0.720890
2018-12-15   -1.523788
Freq: D, Name: c, dtype: float64
----------------------
2018-12-10    0.923304
2018-12-11   -2.031389
2018-12-12    1.819321
2018-12-13    1.117384
2018-12-14   -0.913996
2018-12-15   -1.065776
Freq: D, Name: d, dtype: float64
----------------------

a    None
b    None
c    None
d    None
dtype: object

In [155]:
df

                    a         b         c         d
2018-12-10  10.000000 -1.572946  0.086986  0.923304
2018-12-11  -0.290137 -0.552569 -0.648360 -2.031389
2018-12-12  -0.697431  0.438184 -0.445619  1.819321
2018-12-13  -1.395159 -0.310460 -0.636245  1.117384
2018-12-14   0.145845 -0.025134 -0.720890 -0.913996
2018-12-15   0.445046 -1.508589 -1.523788 -1.065776

### 이미 존재하는 파일의 내용을 기반으로 Dataframe 생성하기

In [159]:
# 외부 폴더의 파일을 read 해서 dataframe 객체 생성
# 상대경로 -> 현재 내 위치를 기준으로  
# 절대경로 -> 어디서나 절대적으로 찾아갈 수 있는 경로 "C:\0.ITstudy\00.dataSet\friend.csv"
df = pd.read_csv("../00.dataSet/friend.csv")
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [166]:
df.loc[:,['이름','hobby']]

    이름  hobby
0  신동엽  music
1  유재석    art
2  김새롬  study
3  이영자   talk
4  강호동   talk

In [176]:
# 이영자를 이영순으로 바꾸어보기
df.loc[3,'이름'] = '이영순'
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영순  45  상담사   talk
4  강호동  38  연예인   talk

In [175]:
# tab 으로 데이터를 구분한 파일의 내용으로 Dataframe 객체 생성하기
df = pd.read_csv("../00.dataSet/friendsTab.txt", delimiter='\t')
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

### 원천 데이터 (raw)에 컬럼명으로 사용될 header 정보가 없을 경우 주의사항<br>
1. DataFrame 생성시 데이터의 첫 라인이 header정보로 사용되지 않게 속성으로 제어해야함<br>

> 1 단계 실습 : 신동엽 정보가 header정보로 사용 -> colums 추가 -> 정보 손실<br>
  2 단계 실습 : 데이터 손실없이 작업

In [187]:
# header 정보가 없는 파일을 read 해서 가공하기
df = pd.read_csv("../00.dataSet/friendsTabNoHead.txt", delimiter='\t')
df

   신동엽  20  연예인  music
0  유재석  41   교수    art
1  김새롬  18   학생  study
2  이영자  45  상담사   talk
3  강호동  38  연예인   talk

In [188]:
df.columns

Index(['신동엽', '20', '연예인', 'music'], dtype='object')

In [189]:
df.columns = ['name', 'age', 'job', 'hobby']
df
# 신동엽이 사라짐

  name  age  job  hobby
0  유재석   41   교수    art
1  김새롬   18   학생  study
2  이영자   45  상담사   talk
3  강호동   38  연예인   talk

In [183]:
# 2 단계 :
df = pd.read_csv("../00.dataSet/friendsTabNoHead.txt", delimiter='\t',header=None)
df

     0   1    2      3
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [184]:
df.columns = ['name', 'age', 'job', 'hobby']
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [185]:
# 3 단계 : Dataframe 생성 시점에 컬럼명 반영
df = pd.read_csv("../00.dataSet/friendsTabNoHead.txt", delimiter='\t',header=None, names=['name', 'age', 'job', 'hobby'])
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

### python data 타입으로부터 Dataframe 생성 및 가공

In [222]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'}]

In [223]:
type(friend_dict_list)

list

In [224]:
#  리스트를 dataframe으로 바꾸기, 순서 거꾸로
df = pd.DataFrame(friend_dict_list)
df

   age  hobby  job name
0   20  music  연예인  신동엽
1   41    art   교수  유재석
2   18  study   학생  김새롬
3   45   talk  상담사  이영자
4   38   talk  연예인  강호동

In [212]:
df.name

0    신동엽
1    유재석
2    김새롬
3    이영자
4    강호동
Name: name, dtype: object

In [227]:
df = df[['name','age','job','hobby']]
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [231]:
# df2 라는 변수한테 friends_dict_list가 보유한 일반 python 의 list로 dataframe 생성하라
# 단, columns 순서는 name, age, job, hobby 순으로 생성
# 생성 시점에 columns 순서를 정할 수 있는지에 대해 문제
df2 = pd.DataFrame(friend_dict_list, columns=['name','age','job','hobby'], index = ['영','일','이','삼','사'])
df2

  name  age  job  hobby
영  신동엽   20  연예인  music
일  유재석   41   교수    art
이  김새롬   18   학생  study
삼  이영자   45  상담사   talk
사  강호동   38  연예인   talk

### 정제한 dataframe 을 csv파일로 출력하기

In [242]:
df2.to_csv("../00.dataSet/11_out.csv", index = None, header = None)

  name  age  job  hobby
영  신동엽   20  연예인  music
일  유재석   41   교수    art
이  김새롬   18   학생  study
삼  이영자   45  상담사   talk
사  강호동   38  연예인   talk

In [244]:
#리스트로 데이터 프레임 생성하기 + header 정보만 추가

friends = [['신동엽',20,'연예인','music'], 
           ['유재석',41,'교수','art'], 
           ['김새롬',18,'학생','study'], 
           ['이영자',45,'상담사','talk'], 
           ['강호동',38,'연예인','talk']]

df = pd.DataFrame.from_records(friends)
df

     0   1    2      3
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [245]:
df.columns = ['name','age','job','hobby']
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [246]:
df['salary'] = 0
df

  name  age  job  hobby  salary
0  신동엽   20  연예인  music       0
1  유재석   41   교수    art       0
2  김새롬   18   학생  study       0
3  이영자   45  상담사   talk       0
4  강호동   38  연예인   talk       0

In [250]:
# job이 학생인 경우 salary 값이 no, 아닌경우 yes
# np.where
# 삼항 연산자 구조 : 다른 보편적인 언어들 -> 조건식?true일때:false일때
# 파이썬의 삼항연산자 구조 : ->  df['salary'] = np.where(df['job'] != '학생', 'yes','no')

df['salary'] = np.where(df['job'] != '학생', 'yes','no')
df

  name  age  job  hobby salary
0  신동엽   20  연예인  music    yes
1  유재석   41   교수    art    yes
2  김새롬   18   학생  study     no
3  이영자   45  상담사   talk    yes
4  강호동   38  연예인   talk    yes

### 중복 데이터 처리
> 1단계 : 100% 모든 데이터 동일한 것으로 테스트 하기<br>
  2단계 : age 컬럼 값만 다를 경우 중복이 아니다 false 출력 확인<br>

In [252]:
#step01
friend_dict_list = [ {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': 100, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)
df = df[['name', 'age', 'job', 'hobby']]
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [254]:
df.duplicated() # 중복값 검사

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [257]:
df = df.drop_duplicates() # 중복된 값 제거
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [259]:
#step02
friend_dict_list = [ {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': 100, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)
df = df[['name', 'age', 'job', 'hobby']]
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽  100  연예인  music

In [265]:
df.duplicated() # 데이터값이 하나라도 다르면 false 출력

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [267]:
df.drop_duplicates() # 제거되지 않음

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽  100  연예인  music

In [275]:
df.drop_duplicates(['name'], keep='first') # name값을 기준으로 삭제

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [281]:
df.drop_duplicates(['name'], keep='last') # name값을 기준으로 삭제

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽  100  연예인  music

In [284]:
# inplace=True 원본 dataframe에 영향을 주는 속성
df.drop_duplicates(['name'], keep='last', inplace=True)
df

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽  100  연예인  music

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽  100  연예인  music

In [349]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)
df = df[['name', 'age', 'job', 'hobby']]
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [334]:
type(df)

pandas.core.frame.DataFrame

In [335]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
name     6 non-null object
age      5 non-null float64
job      6 non-null object
hobby    6 non-null object
dtypes: float64(1), object(3)
memory usage: 272.0+ bytes

In [336]:
df.isna() # 결측치 확인 함수

    name    age    job  hobby
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False   True  False  False

In [337]:
df.isnull() # 결측치 확인 함수

    name    age    job  hobby
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False   True  False  False

In [338]:
df['age'].sum()

162.0

In [339]:
df['age'].mean()

32.4

In [340]:
df.T

           0    1      2     3     4      5
name     신동엽  유재석    김새롬   이영자   강호동    신동엽
age       20   41     18    45    38    NaN
job      연예인   교수     학생   상담사   연예인    연예인
hobby  music  art  study  talk  talk  music

In [352]:
# nan을 0으로 치환 : 평균을 제대로 구하기
# inplace는 원본에 적용여부 
df['age'].fillna(0, inplace=True)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   0.0  연예인  music

In [353]:
df['age'].mean()

27.0

In [4]:
import pandas as pd
import numpy as np

In [18]:

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)
df = df[['name', 'age', 'job', 'hobby']]
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

### groupby()
### transform()

In [24]:
# age의 평균을 구해서 2번째 동명이인인 신동엽의 나이에게 대입
# NaN이 평균나이로 변경됨
df['age'].fillna(df.groupby('job')['age'].transform('mean'), inplace = True)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽  29.0  연예인  music

In [25]:
# type은 DataFrameGroupBy 
df.groupby('job')

In [26]:
# SeriesGroupBy 
df.groupby('job')['age']

## 중복 데이터 관련된 unique 처리 기술 학습
> 1. db의 distinct 와 같은 기능 학습
    - 오라클 db의 emp 사원 테이블의 job의 종류가 중복되지 않게 검색 : <br>
    - select distinct job from emp

In [27]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' : '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                     {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'},
                     {'name': '고현정', 'age': 44, 'job': '가수', 'hobby':'music'},
                     {'name': '박민영', 'age': 22, 'job': '학생', 'hobby':'art'},
                     {'name': '박서준', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '박보검', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' : '이효리', 'age' : 28, 'job' : '교수', 'hobby' : 'talk'},
                    {'name': '이상순', 'age': 29, 'job': '주부', 'hobby':'music'}]

df = pd.DataFrame(friend_dict_list)
df = df[['name', 'age', 'job', 'hobby']]
df

   name   age  job  hobby
0   신동엽  20.0  연예인  music
1   유재석  41.0   교수    art
2   김새롬  18.0   학생  study
3   이영자  45.0  상담사   talk
4   강호동  38.0  연예인   talk
5   신동엽   NaN  연예인  music
6   고현정  44.0   가수  music
7   박민영  22.0   학생    art
8   박서준  18.0   학생  study
9   박보검  45.0  상담사   talk
10  이효리  28.0   교수   talk
11  이상순  29.0   주부  music

In [30]:
print(df.job.unique()) # 중복되지 않는 값 검색

['연예인' '교수' '학생' '상담사' '가수' '주부']

In [31]:
type(df.job)

pandas.core.series.Series

In [32]:
df.job.unique()

array(['연예인', '교수', '학생', '상담사', '가수', '주부'], dtype=object)

In [33]:
df.job.value_counts()

학생     3
연예인    3
교수     2
상담사    2
가수     1
주부     1
Name: job, dtype: int64

In [34]:
type(df.job.value_counts())

pandas.core.series.Series

In [43]:
# hobby 종류 검색, 갯수 확인, 취미 별 인원수 파악
print(df.hobby.unique())
print(df.hobby.value_counts())
print(df.groupby('hobby').size())

['music' 'art' 'study' 'talk']
talk     4
music    4
art      2
study    2
Name: hobby, dtype: int64
hobby
art      2
music    4
study    2
talk     4
dtype: int64

In [44]:
l1 = [{'name': '이효리', 'job': "교수"},
      {'name': '이상순', 'job': "학생"},
      {'name': '박보검', 'job': "개발자"}]

l2 = [{'name': '신동엽', 'job': "치과의사"},
      {'name': '이영자', 'job': "농부"},
      {'name': '정찬우', 'job': "연예인"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [45]:
df1

  name  job
0  이효리   교수
1  이상순   학생
2  박보검  개발자

In [46]:
df2

  name   job
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [47]:
print(type(df1), type(df2))

<class 'pandas.core.frame.DataFrame'> <class 'pandas.core.frame.DataFrame'>

In [50]:
df3 = [df1, df2]
df3

[  name  job
 0  이효리   교수
 1  이상순   학생
 2  박보검  개발자,   name   job
 0  신동엽  치과의사
 1  이영자    농부
 2  정찬우   연예인]

In [51]:
df4 = pd.concat(df3)
df4

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [53]:
df4 = pd.concat(df3, ignore_index=True)
df4

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
3  신동엽  치과의사
4  이영자    농부
5  정찬우   연예인

In [76]:
# 컬럼 기준으로 데이터 병합하기
l1 = [{'name': '이효리', 'job': "교수"},
      {'name': '이상순', 'job': "학생"},
      {'name': '박보검', 'job': "개발자"}]

l2 = [{'name': '신동엽', 'job': "치과의사"},
      {'name': '이영자', 'job': "농부"},
      {'name': '정찬우', 'job': "연예인"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [77]:
df3 = [df1,df2]
df4 = pd.concat(df3, axis=1)
df4

  name  job name   job
0  이효리   교수  신동엽  치과의사
1  이상순   학생  이영자    농부
2  박보검  개발자  정찬우   연예인

In [107]:
# 컬럼명 수정, 이름, 직업
df4.columns = ['이름', '직업1', '이름', '직업2']
df4

    이름  직업1   이름   직업2
0  이효리   교수  신동엽  치과의사
1  이상순   학생  이영자    농부
2  박보검  개발자  정찬우   연예인

In [108]:
type(df4[:3]['직업2'])

pandas.core.series.Series

In [112]:
df4['직업2'][0:1]

0    치과의사
Name: 직업2, dtype: object

In [113]:
df4['직업1'][0]

'교수'

In [125]:
tmp1 = df4['직업1'][0]
tmp2 = df4['직업2'][0]
print(tmp1, tmp2)

교수 치과의사

### 문제
 > Q1 학생들간에 중간, 기말 성적들 만으로 총점 , 평균을 추가<br>
   Q2 데이터 프레임도 반복문으로 처리 가능 / 평균값을 반복문으로 출력해보기 for in <br>
   Q3 등급 grade 이라는 컬럼 추가 / 90점 이상(A), 80점이상 (B), 그 외 F등급/ 파이썬 조건문 사용해서 처리해보기

In [192]:
friend_dict_list = [{'이름': '나학생1', '중간고사점수': 95, '기말고사점수': 85},
         {'이름': '나학생2', '중간고사점수': 85, '기말고사점수': 80},
         {'이름': '나학생3', '중간고사점수': 10, '기말고사점수': 30}]

df = pd.DataFrame(friend_dict_list, columns = ['이름', '중간고사점수', '기말고사점수'])
df

     이름  중간고사점수  기말고사점수
0  나학생1      95      85
1  나학생2      85      80
2  나학생3      10      30

In [194]:
df['총점'] = df['중간고사점수']+ df['기말고사점수']
df

     이름  중간고사점수  기말고사점수   총점
0  나학생1      95      85  180
1  나학생2      85      80  165
2  나학생3      10      30   40

In [195]:
df['평균'] =( df['중간고사점수']+ df['기말고사점수'] ) / 2
df

     이름  중간고사점수  기말고사점수   총점    평균
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

In [196]:
for v in df:
    print(v)

이름
중간고사점수
기말고사점수
총점
평균

In [197]:
for key, value in df.iteritems():
    print(key, " ", value)

이름   0    나학생1
1    나학생2
2    나학생3
Name: 이름, dtype: object
중간고사점수   0    95
1    85
2    10
Name: 중간고사점수, dtype: int64
기말고사점수   0    85
1    80
2    30
Name: 기말고사점수, dtype: int64
총점   0    180
1    165
2     40
Name: 총점, dtype: int64
평균   0    90.0
1    82.5
2    20.0
Name: 평균, dtype: float64

In [214]:
df['등급'] = None
grade = []
for avg in df['평균']:
    if avg >= 90:
        grade.append('A')
    elif avg >= 80:
        grade.append('B')
    else:
        grade.append('F')
df['등급'] = grade
df

     이름  중간고사점수  기말고사점수   총점    평균 등급
0  나학생1      95      85  180  90.0  A
1  나학생2      85      80  165  82.5  B
2  나학생3      10      30   40  20.0  F

### 문제 : 
> '이수여부' 라는 컬럼을 추가하되 등급을 기준으로 <br>
    f인 경우 fail / F 가 아닌경우 pass 값으로 반영 <br>
    단 lambda 문법으로 처리해보기

In [217]:
df['이수여부'] = df['등급'].apply(lambda x :'pass' if x != 'F' else 'fail')
df

     이름  중간고사점수  기말고사점수   총점    평균 등급  이수여부
0  나학생1      95      85  180  90.0  A  pass
1  나학생2      85      80  165  82.5  B  pass
2  나학생3      10      30   40  20.0  F  fail

### 문제 :
> apply 함수를 사용해서 년월일 정보에서 년에 해당하는 정보만 반환

In [219]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2018-12-20'}]

df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2018-12-20

In [234]:
def getYear(row):
    return row.split('-')[0]

In [241]:
# 사용자 정의 함수를 개발해서 apply()에서 호출
df['year'] = df['yyyy-mm-dd'].apply(getYear)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2018-12-20  2018

In [253]:
def getAge(year , currentYear):
    return currentYear - int(year)

In [254]:
# apply 함수 안에는 소괄호 쓰면 안됨
df['age'] = df['year'].apply(getAge, currentYear=2018)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2018-12-20  2018    0

In [257]:
def getinfo(age, prefix, suffix):
    return prefix + str(age) + suffix

In [258]:
df['info'] = df['age'].apply(getinfo, prefix='내 나이는 ', suffix='살')
df

   yyyy-mm-dd  year  age       info
0  2000-06-27  2000   18  내 나이는 18살
1  2002-09-24  2002   16  내 나이는 16살
2  2018-12-20  2018    0   내 나이는 0살

In [259]:
student_list = [{'name': 'John', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Abraham', 'major': "Physics", 'gender': "male"},
                {'name': 'Brian', 'major': "Psychology", 'gender': "male"},
                {'name': 'Janny', 'major': "Economics", 'gender': "female"},
                {'name': 'Yuna', 'major': "Economics", 'gender': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'gender': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Zara', 'major': "Psychology", 'gender': "female"},
                {'name': 'Wendy', 'major': "Economics", 'gender': "female"},
                {'name': 'Sera', 'major': "Psychology", 'gender': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'gender'])
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [264]:
df.groupby('major').groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [265]:
df.groupby('major').name

In [268]:
for name, group in group_major:
    print(name+ " "+str(len(group)))
    print(group)

Computer Science 4
       name             major  gender
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male
Economics 3
    name      major  gender
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female
Physics 1
      name    major gender
2  Abraham  Physics   male
Psychology 3
     name       major  gender
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [269]:
# 그룹 변수는 각 컬럼명 사용 가능
# 호출 가능 속성명 : name / gender / major
group_major.major

In [270]:
# name 변수 : 변수명 가변적, 보유하게 되는 데이터 값은 그룹핑된 데이터 이름
# group 변수 : 변수명 가변적, 보유하게 되는 데이터
group_major.size()

major
Computer Science    4
Economics           3
Physics             1
Psychology          3
dtype: int64

In [273]:
# index도 없고 count도 정렬이 안되어 찍힘
df2 = pd.DataFrame({'count':group_major.size()})
df2

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

In [274]:
df3 = pd.DataFrame({'count':group_major.size()}).reset_index() # 재정렬
df3

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

### 마지막 문제: 
>  - gender별로 그룹화 하기<br>
   - 그룹 단위로 이름, 전공,성별 구조로 출력하기<br>
   - 성별 인원수로 새로운 DataFrame 생성하기<br>

In [278]:
group_gender = df.groupby('gender')
group_gender.gender.size()

gender
female    6
male      5
Name: name, dtype: int64

In [280]:
for gender, group in group_gender:
    print(gender)
    print(group)

female
        name             major  gender
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
male
      name             major gender
0     John  Computer Science   male
1     Nate  Computer Science   male
2  Abraham           Physics   male
3    Brian        Psychology   male
7   Edward  Computer Science   male

In [283]:
group_gender.gender.size()
dfgender = pd.DataFrame({'gender count' : group_gender.gender.size()}).reset_index()
dfgender

   gender  gender count
0  female             6
1    male             5